[{"id":"0.48379273211845053","title":"A Mother's Love by Marilee Joy Mayfield","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/61qOgDaa7qL.jpg","description":"This beautiful book is made to help every child understand how many things mothers actually do to help their kids feel loved, happy, and safe... The special bond a mother shares with her children is one of the most powerful forces of nature. The unconditional love from the ever-watchful eye of a mother is something to always be cherished.","price":"14.39"},{"id":"0.5219502972085437","title":"Alexander and the Terrible, Horrible, No Good, Very Bad Day by Judith Viorst","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/810FjyuPGPL.jpg","description":"Alexander could tell it was going to be a terrible, horrible, no good, very bad day. He went to sleep with gum in his mouth and woke up with gum in his hair. When he got out of bed, he tripped over his skateboard and by mistake dropped his sweater in the sink while the water was running. He could tell it was going to be a terrible, horrible, no good, very bad day.\r\n\r\nIt was a terrible, horrible, no good, very bad day. Nothing at all was right. Everything went wrong, right down to lima beans for supper and kissing on TV.\r\n\r\nWhat do you do on a day like that? Well, you may think about going to Australia. You may also be glad to find that some days are like that for other people too.","price":"11.59"},{"id":"0.9838093033945032","title":"Cloudy With a Chance of Meatballs by Judi Barrett","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/71AIAUDZYXL.jpg","description":"The tiny town of Chewandswallow was very much like any other tiny town—except for its weather which came three times a day, at breakfast, lunch, and dinner.\r\n\r\nBut it never rained rain and it never snowed snow and it never blew just wind. It rained things like soup and juice. It snowed things like mashed potatoes. And sometimes the wind blew in storms of hamburgers.\r\n\r\nLife for the townspeople was delicious until the weather took a turn for the worse. The food got larger and larger and so did the portions. Chewandswallow was plagued by damaging floods and storms of huge food. The town was a mess and the people feared for their lives.","price":"18.80"},{"id":"0.928841668991899","title":"Go, Dog, Go by P.D. Eastman","imageUrl":"https://m.media-amazon.com/images/P/0394800206.01._SCLZZZZZZZ_SX500_.jpg","description":"Written for beginning readers using only 75 different words, this beloved Beginner Book by P.D. Eastman—edited by Dr. Seuss—features all kinds of wonderful dogs riding bicycles, scooters, skiis, roller skates, and driving all sorts of vehicles on their way to a party held on top of a tree! Available for a limited time only with a peel-off 60th Anniversary Edition sticker on the front cover, this is a perfect gift for P.D. Eastman fans and dog lovers of all ages!","price":"4.99"},{"id":"0.4875089482721022","title":"I Love You to the Moon and Back by Amelia Hepworth","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/81eB+7+CkUL.jpg","description":"The sun rises, and a bear and cub begin their day together. They splash in the water, climb mountains, watch the colorful lights in the shimmering sky, and play with friends. They show their love for each other by touching noses, chasing each other, and, of course, hugging and snuggling before bed. A sweet, gentle rhyme, perfect for sharing with a special little one that also includes a “To” and \"From” personalization page in the front of the book, making this heartwarming book an ideal gift.","price":"4.22"},{"id":"0.7982374654793862","title":"I Spy Spooky Night: A Book of Picture Riddles by Jean Marzallo","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51-+6KbMMVL.jpg","description":"Kids of all ages will enjoy a fun and spooky exploration as a trickster skeleton beckons readers from room to room to I Spy for mice, spiders, candles, bats, jack-o'-lanterns, bones, and so much more! From its rickety gate to its cobwebbed attic, this haunted house contains 13 spooky and spectacular photographs. There is a spooky graveyard, a mysterious laboratory, a garden of ghoulies -- each page has rhyming puzzles with eerie objects to find.It's time to join the millions of fans who have enjoyed I Spy for over 20 years. And get ready to solve even more riddles with a brand-new brain twister riddle section at the back of the book. It's been 13 years since I Spy Spooky Night was originally published. Are you ready to start your chilling search?","price":"10.62"},{"id":"0.10282372193829059","title":"If You Give a Cat a Cupcake by Laura Numeroff","imageUrl":"https://m.media-amazon.com/images/P/0060283246.01._SCLZZZZZZZ_SX500_.jpg","description":"If you give a cat a cupcake, he'll ask for some sprinkles to go with it. When you give him the sprinkles, he might spill some on the floor. Cleaning up will make him hot, so you'll give him a bathing suit . . .","price":"8.99"},{"id":"0.1628975757471265","title":"If You Give a Mouse a Cookie by Laura Numeroff","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51aCFGh8IBL._SX258_BO1,204,203,200_.jpg","description":"If a hungry little mouse shows up on your doorstep, you might want to give him a cookie. And if you give him a cookie, he'll ask for a glass of milk. He'll want to look in a mirror to make sure he doesn't have a milk mustache, and then he'll ask for a pair of scissors to give himself a trim....\r\n\r\nThis book is a great first introduction to Mouse, the star of the If You Give... series and a perennial favorite among children. With its spare, rhythmic text and circular tale, If You Give a Mouse a Cookie is perfect for beginning readers and story time!","price":"10.88"},{"id":"0.36714987630997675","title":"If You Give a Pig a Pancake by Laura Numeroff","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/81XBfN7KqhL.jpg","description":"If you give a pig a pancake, she'll want some syrup to go with it. You'll give her some of your favorite maple syrup, and she'll probably get all sticky, so she'll want to take a bath. She'll ask you for some bubbles. When you give her the bubbles...\r\n\r\nReaders will delight in the story of an accommodating little girl who tries to keep up with the whims of a busy little pig.","price":"8.74"},{"id":"0.9724125026542094","title":"Love You Forever by Robert Munsch","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/81vpsIs58WL.jpg","description":"A young woman holds her newborn son\r\nAnd looks at him lovingly.\r\n\r\nSoftly she sings to him:\r\n\"I'll love you forever\r\nI'll like you for always\r\nAs long as I'm living\r\nMy baby you'll be.\"\r\nSo begins the story that has touched the hearts of millions worldwide. ","price":"11.69"},{"id":"0.5017160996802092","title":"Parts by Tedd Arnold","imageUrl":"https://m.media-amazon.com/images/P/0140565337.01._SCLZZZZZZZ_SX500_.jpg","description":"The young narrator has discovered a disturbing trend: There's fuzz in his belly button his toes are peeling and something just fell out of his nose. The last straw is a loose tooth, which convinces him of the awful truth his parts are coming unglued!Parts deals with a subject of deepest interest to every young child: the stuff our bodies shed. ","price":"15.99"},{"id":"0.03558192046109476","title":"Penguin Problems by Jory John","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/A1Ztc6ma-+L.jpg","description":"Have you ever considered running away to Antarctica? Of course you have! Because it's a land free of worries and responsibilities! All of your problems will surely be blown away by the icy winds of that lawless paradise! . . . Won't they?\r\n \r\nThink again, my friend. This penguin has come to tell you that his life down there is no more a picnic than yours is here. For starters, it is FREEZING. Also, penguins have a ton of natural predators. Plus, can you imagine trying to find your mom in a big ol' crowd of identical penguins? No, thank you.\r\n \r\nYes, it seems there is no escaping the drudgery of your daily grind, whatever it might be. Or perhaps we've just learned that grumps are everywhere. . . .","price":"15.16"},{"id":"0.2440589664869406","title":"Piggies by Audrey Wood & Dan Wood","imageUrl":"https://target.scene7.com/is/image/Target/GUEST_701753c4-d318-4d66-bca0-c3bcf31fc8cc?wid=488&hei=488&fmt=pjpeg","description":"Children will delight in the antics of ten marvelous little piggies who romp from fingers to toes in this original bedtime fantasy. Don Wood’s oil paintings explode with mirth and magic and will engage all young readers.\"Trying to describe these luxuriant, witty pictures doesn’t really work, however; seeing is believing, and what luck for us there’s so much to see.\"--Booklist\r\n","price":"18.80"},{"id":"0.9813264205356975","title":"Possum Come A-Knockin' by Nancy Van Laan","imageUrl":"https://m.media-amazon.com/images/P/0679834680.01._SCLZZZZZZZ_SX500_.jpg","description":"\"While Granny is a-rockin' and a-knittin' and Ma's a-cookin' and Pa's a-fixin', that old possum in his top hat and vest just keeps on knocking. The narrator, a redheaded boy, tries to tell family members about the possum, and when the family checks, the possum hides. Should be popular with story-hour groups.\"--Booklist.","price":"17.35"},{"id":"0.748505479852678","title":"Ten Little Dinosaurs by Pattie Schnetzler","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/913RyEX+xxL.jpg","description":"A pair of crazy eyeballs built into this boldly illustrated hardbound book jiggle and wiggle from page to page and dinosaur to dinosaur.\r\n\r\nBoth fun and informative, children and parents will be repeating this story's catchy rhyme long after the first reading.\r\n\r\nReading Rainbow Book recipient Jim Harris provides his artistic excellence, humor, and stylistic integrity to this one-of-a-kind production.\r\n\r\nA tremendously fun book for young dinosaur enthusiasts and an ideal counting book for younger ages as well.","price":"8.95"},{"id":"0.7224591360587864","title":"Ten Little Fish","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51M-FXaePyL._SX258_BO1,204,203,200_.jpg","description":"Follow ten little fish as they swim along a beautiful ocean reef, one by one departing from the school for different reasons, eventually leaving one fellow all alone. What will he do? Along comes another, and that makes two! Soon he becomes a father and she becomes a mother--with ten little children of their own. The rhyming text helps readers go from one to ten and back again, and each illustration pops with all the color and depth of an underwater playground.","price":"14.99"},{"id":"0.44345336802845736","title":"The Giving Tree by Shel Silverstein","imageUrl":"https://m.media-amazon.com/images/P/B00DB2QZPI.01._SCLZZZZZZZ_SX500_.jpg","description":"The Giving Tree turns fifty! To celebrate the anniversary of this classic favorite by Shel Silverstein, this edition features a beautiful metallic green jacket, a commemorative gold sticker, and a CD recording of Silverstein reading The Giving Tree.\r\n\r\nSince it was first published fifty years ago, Shel Silverstein's poignant picture book for readers of all ages has offered a touching interpretation of the gift of giving and a serene acceptance of another's capacity to love in return.","price":"11.99"},{"id":"0.6279760039009259","title":"The Napping House","imageUrl":"https://m.media-amazon.com/images/P/0152567119.01._SCLZZZZZZZ_SX500_.jpg","description":"In the napping house is a cozy bed piled high with a snoring granny, a dreaming child, a dozing dog, a snoozing cat, and a slumbering mouse. All is at peace until the appearance of an unexpected visitor and before you know it, no one is sleeping! The rounded corners, and sturdy board book pages make this book a great gift for little ones.","price":"13.29"}]